package util;

public interface IData {
    String text = "В первобытном обществе уровень экономического развития был низким, обеспечивающим потребление на грани " +
            "физического выживания. Сначала первобытные люди добывали средства к существованию охотой и собирательством," +
            " но в результате неолитической революции возникли земледелие и животноводство. Развитие общества привело к " +
            "разделению труда и социальному неравенству, появились социальные классы и государство. Возникло рабовладение." +
            "\n" +
            "Постепенно развивался товарообмен, который сначала осуществлялся в форме натурального обмена (бартера), но" +
            " с появлением денег превратился в торговлю. Тем не менее, в обществах Древнего мира и Средневековья " +
            "преобладающим было натуральное хозяйство. Во многих государствах древности существовала так называемая " +
            "дворцовая экономика, основанная на сочетании планового хозяйства (позволяющего осуществлять крупные " +
            "общественные работы, такие как ирригация, сооружение дворцов и пирамид) и натурального хозяйства.\n" +
            "\n" +
            "С началом крестовых походов европейцы заново открыли для себя пряности, шёлк и другие товары, ставшие " +
            "редкими в Европе в Средние века. Это открытие привело к расширению торговли и обострению торговой " +
            "конкуренции со странами Востока.";
}
